{
  "added_tokens_decoder": {
    "1": {
      "content": "</s>",
      "lstrip": true,
      "normalized": true,
      "rstrip": true,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "<unk>",
      "lstrip": true,
      "normalized": true,
      "rstrip": true,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [],
  "clean_up_tokenization_spaces": true,
  "do_lower_case": true,
  "eos_token": "</s>",
  "model_input_names": ["input_ids"],
  "model_max_length": 64,
  "pad_token": "</s>",
  "processor_class": "SiglipProcessor",
  "sp_model_kwargs": {},
  "tokenizer_class": "SiglipTokenizer",
  "trust_remote_code": false,
  "unk_token": "<unk>"
}
